RPA/Files/ApplyReceipt/Request/SampleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/receipts/shared/standardReceiptService/commonService/types/" xmlns:com="http://xmlns.oracle.com/apps/financials/receivables/receipts/shared/standardReceiptService/commonService/" xmlns:app="http://xmlns.oracle.com/apps/flex/financials/receivables/receipts/shared/standardReceiptService/commonService/ApplyReceiptDff/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:createApplyReceipt>
         <typ:applyReceipt>
            <com:AmountApplied>100</com:AmountApplied>
            <com:Comments>Test Comments</com:Comments>
            <com:Instalment>1</com:Instalment>
            <com:ReceiptId>300000003162743</com:ReceiptId>
             <com:CustomerTrxId>300000002787011</com:CustomerTrxId>
            <com:CustomerName>MSS Customer</com:CustomerName>
            <com:ApplicationDate>2021-02-02</com:ApplicationDate>
            <com:AccountingDate>2021-02-02</com:AccountingDate>
         </typ:applyReceipt>
      </typ:createApplyReceipt>
   </soapenv:Body>
</soapenv:Envelope>
